# ─────────────────────────────────────────────────────────────
# Package list for the Hyprland rice — real hardware ("showroom")
#
# Generated from the VM on 2026-07-11 with:  pacman -Qqen
# (35 explicit packages, zero AUR — nice and clean to reproduce.)
#
# Install everything (the grep strips these comments before pacman sees them):
#   grep -vE '^\s*#|^\s*$' install/pkglist.txt | sudo pacman -S --needed -
#
# WHAT CHANGED vs the VM:
#   - DROPPED: virtualbox-guest-utils  (VM-only — do NOT install on real HW)
#   - ADDED:   a GPU driver, intel-ucode, efibootmgr, os-prober
#              (see the "REAL HARDWARE ONLY" section at the bottom)
#   - ADDED (2026-07-11 audit): packages the configs already depend on but the
#     `pacman -Qqen` export missed (deps aren't listed as explicit), plus
#     desktop plumbing a VM hides but real hardware wants: portals, a polkit
#     agent, screen lock, clipboard CLI, fonts. Marked "audit" below.
# ─────────────────────────────────────────────────────────────

# --- Base system (archinstall usually lays these down; --needed skips dupes) ---
base
linux
linux-firmware
sudo
git

# --- Networking ---
networkmanager
wpa_supplicant
openssh                 # SSH server — enables the VS Code Remote-SSH dev workflow

# --- Compositor / desktop shell ---
hyprland
waybar
mako                    # notification daemon
swaybg                  # wallpaper daemon currently IN USE (see vm-substitutions.md)
hyprpaper               # real-HW target — decide swaybg vs hyprpaper per vm-substitutions.md
hyprlock                # audit: screen lock — shared family laptop, lock from day one
hypridle                # audit: idle daemon (locks/dims on idle, lid) — needs a config, see migration doc
xdg-desktop-portal-hyprland  # audit: screen sharing + app portals under Hyprland
xdg-desktop-portal-gtk       # audit: file-picker dialogs (Firefox etc.) via the portal
hyprpolkitagent         # audit: GUI privilege prompts — without an agent they fail silently

# --- Launcher ---
rofi                    # NOTE: phase-3 intent was rofi-wayland; this VM has plain `rofi`.
                        # Verify which behaves best under Hyprland on real HW before committing.
wofi                    # legacy launcher, kept installed but unused (roadmap step 3)

# --- Terminal ---
foot                    # fallback terminal (works everywhere)
kitty                   # real-HW target — crashed in the VM; retest, keep foot as fallback

# --- Apps ---
firefox                 # browser (workspace 3)
yazi                    # file manager (workspace 2)
cava                    # audio visualizer (Control Center, workspace 0)
playerctl               # audit: media keybinds + cc-music widget — was only a dep in the VM,
                        # so the -Qqen export missed it; without it both silently degrade

# --- Audio stack (PipeWire) ---
pipewire
pipewire-alsa
pipewire-jack
pipewire-pulse
wireplumber
gst-plugin-pipewire
libpulse

# --- Fonts ---
ttf-jetbrains-mono-nerd # waybar's Nerd Font glyphs depend on this — don't skip it
noto-fonts              # audit: general text fallback — only present as a dep in the VM
noto-fonts-emoji        # audit: emoji in Firefox / notifications render as boxes without it

# --- Tooling / misc ---
grim                    # screenshots
slurp                   # audit: region select for grim (Shift+Print keybind)
wl-clipboard            # audit: wl-copy / wl-paste — the clipboard CLI scripts + yazi expect
brightnessctl           # audit: hyprland.lua already binds the brightness keys to it
nano
less
python                  # audit: theme/gen.py + the widgets — was only a transitive dep
python-gobject
pacman-contrib          # audit: paccache — enable paccache.timer to trim the package cache
zram-generator          # compressed swap — NEEDS install/etc/zram-generator.conf copied to
                        # /etc/systemd/ or it does nothing (see migration doc step 4)
grub                    # bootloader — reused to host the Windows dual-boot menu

# ─────────────────────────────────────────────────────────────
# REAL HARDWARE ONLY — not present in the VM, add these by hand
# ─────────────────────────────────────────────────────────────

# --- CPU microcode (your i5 is Intel) ---
intel-ucode

# --- Dual-boot with Windows ---
efibootmgr              # writes UEFI boot entries (needed for a UEFI GRUB install)
os-prober               # lets GRUB detect Windows and add it to the boot menu

# --- GPU driver ---
mesa                    # userspace OpenGL — needed by every vendor
# Then UNCOMMENT the block matching the Pavilion's GPU.
# Find it with:  lspci | grep -EA3 'VGA|3D'
#
# Intel integrated:
#   vulkan-intel
#   intel-media-driver
#
# AMD (integrated or dedicated) — video decode (VA-API) is inside mesa now
# (the old standalone libva-mesa-driver package no longer exists):
#   vulkan-radeon
#
# Nvidia (older dedicated card — CHECK first; the migration doc has the full
# decision tree). Short version:
#   * Laptop is likely OPTIMUS (Intel iGPU + Nvidia dGPU): run the desktop on
#     the Intel block above and leave the Nvidia card idle — nothing to add.
#   * Display wired to the Nvidia card only: nouveau (already in mesa) runs
#     Hyprland fine for a rice — nothing to add.
#   * Vendor driver, only if genuinely needed AND the card is new enough:
#     the repos now ship ONLY nvidia-open (the closed `nvidia` package is
#     gone), which covers Turing (GTX 16xx/RTX) and newer. Maxwell/Pascal
#     need AUR nvidia-580xx-dkms, Kepler AUR nvidia-470xx-dkms (rough under
#     Wayland — prefer nouveau). Any -dkms build also needs linux-headers.
#   nvidia-open
#   nvidia-utils
#   egl-wayland
#   linux-headers
